app/views/admin/orders.html.erb

SELECT "orders".* FROM "orders" ORDER BY "orders"."id" ASC
---

<% @orders.order(:id).each do |o| %>