app/controllers/application_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def set_cart
		current_user ? session[:cart_id] = current_user.id : ''
		@cart = Cart.find(session[:cart_id])

SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def set_wish
		current_user ? session[:wish_id] = current_user.id : ''
		@wish = Wish.find(session[:wish_id])