app/views/layouts/_header.html.erb

      <% if session[:cart_id].present? %>
      <div class="wish" style="<%= @wish.wish_items.count == 0 ? 'display: none' : '' %>">
---
SELECT COUNT(*) FROM "wish_items" WHERE "wish_items"."wish_id" = $1  [["wish_id", 1]]

          <div class="centered">
            <% totalwish = @wish.wish_items.count %><%= totalwish %>
---
SELECT COUNT(*) FROM "wish_items" WHERE "wish_items"."wish_id" = $1  [["wish_id", 1]]